#include "Player.h"
#include "MyEngine/Utils/GlobalVariables.h"

//==========================================
// 初期化
//==========================================
void Player::Initialize() {
    // 調整項目の登録
    RegisterGV();
}

//==========================================
// 更新
//==========================================
void Player::Update() {
    ApplyGV();
}

//==========================================
// 描画
//==========================================
void Player::Draw() {

}

//==========================================
// 調整項目の登録・適用
//==========================================
void Player::RegisterGV() {
    
}

void Player::ApplyGV() {
  
}